In [1]:
# Dependencies

import pandas as pd
import numpy as np
from config import fred_key
import requests
import json
import matplotlib.pyplot as plt
from pprint import pprint

In [2]:
# API Call
fred_url = "https://api.stlouisfed.org/fred/series/observations?"
fred_series_id= 'FEDFUNDS'
fred_key= fred_key



params = {"series_id": fred_series_id, "apiKey": fred_key}

query_url = f"{fred_url}series_id={fred_series_id}&api_key={fred_key}&file_type=json"

fred_response = requests.get(query_url, params=params).json()

## Interest Rate Data Frame

In [3]:
int_rate_df = pd.DataFrame(fred_response["observations"])
# Reduce to pertinent columns
int_rate_df = int_rate_df[["date", "value"]]
# write a CSV
int_rate_df.to_csv("output_data/int_rate.csv")
int_rate_df

           date value
0    1954-07-01  0.80
1    1954-08-01  1.22
2    1954-09-01  1.07
3    1954-10-01  0.85
4    1954-11-01  0.83
..          ...   ...
818  2022-09-01  2.56
819  2022-10-01  3.08
820  2022-11-01  3.78
821  2022-12-01  4.10
822  2023-01-01  4.33

[823 rows x 2 columns]

In [4]:
# API Call
fred_url = "https://api.stlouisfed.org/fred/series/observations?"
fred_series_id= 'GDP'
fred_key= fred_key


params = {"series_id": fred_series_id, "apiKey": fred_key}

query_url = f"{fred_url}series_id={fred_series_id}&api_key={fred_key}&file_type=json"
fred_response = requests.get(query_url, params=params).json()

## GDP Data Frame

In [5]:
gdp_df = pd.DataFrame(fred_response["observations"])
# Reduce to pertinent columns
gdp_df = gdp_df[["date", "value"]]
# write a CSV
gdp_df.to_csv("output_data/gdp_rate.csv")
gdp_df

           date      value
0    1946-01-01          .
1    1946-04-01          .
2    1946-07-01          .
3    1946-10-01          .
4    1947-01-01    243.164
..          ...        ...
303  2021-10-01  24349.121
304  2022-01-01   24740.48
305  2022-04-01  25248.476
306  2022-07-01  25723.941
307  2022-10-01  26132.458

[308 rows x 2 columns]

In [6]:
# API Call
fred_url = "https://api.stlouisfed.org/fred/series/observations?"
fred_series_id= 'UNRATE'
fred_key= fred_key


params = {"series_id": fred_series_id, "apiKey": fred_key}

query_url = f"{fred_url}series_id={fred_series_id}&api_key={fred_key}&file_type=json"
fred_response = requests.get(query_url, params=params).json()

## Unemployment Rate Data Frame

In [7]:
unemp_df = pd.DataFrame(fred_response["observations"])
# Reduce to pertinent columns
unemp_df = unemp_df[["date", "value"]]
# write a CSV
unemp_df.to_csv("output_data/unemp.csv")
unemp_df

           date value
0    1948-01-01   3.4
1    1948-02-01   3.8
2    1948-03-01   4.0
3    1948-04-01   3.9
4    1948-05-01   3.5
..          ...   ...
896  2022-09-01   3.5
897  2022-10-01   3.7
898  2022-11-01   3.6
899  2022-12-01   3.5
900  2023-01-01   3.4

[901 rows x 2 columns]

## Merged - Int Rate, Unemp, and GDP

In [8]:
merged_int_unemp_gdp_df = pd.merge(pd.merge(int_rate_df, gdp_df, on='date'), unemp_df , on='date')
# Rename the columns
merged_int_unemp_gdp_df = merged_int_unemp_gdp_df.rename(columns={"value_x": "Interest Rate", "value_y": "GDP", "value": "Unemployment Rate"})
# write a CSV
merged_int_unemp_gdp_df.to_csv("output_data/merged_int_unemp_gdp_df.csv")
merged_int_unemp_gdp_df

           date Interest Rate        GDP Unemployment Rate
0    1954-07-01          0.80    390.996               5.8
1    1954-10-01          0.85    399.734               5.7
2    1955-01-01          1.39    413.073               4.9
3    1955-04-01          1.43    421.532               4.7
4    1955-07-01          1.68    430.221               4.0
..          ...           ...        ...               ...
269  2021-10-01          0.08  24349.121               4.5
270  2022-01-01          0.08   24740.48               4.0
271  2022-04-01          0.33  25248.476               3.6
272  2022-07-01          1.68  25723.941               3.5
273  2022-10-01          3.08  26132.458               3.7

[274 rows x 4 columns]

## Merged - Int Rate and GDP

In [9]:
merged_int_gdp_df = pd.merge(int_rate_df, gdp_df, on='date')
# Rename the columns
merged_int_gdp_df = merged_int_gdp_df.rename(columns={"value_x": "Interest Rate", "value_y": "GDP", "value": "Unemployment Rate"})
# write a CSV
merged_int_gdp_df.to_csv("output_data/merged_int_gdp.csv")
merged_int_gdp_df

           date Interest Rate        GDP
0    1954-07-01          0.80    390.996
1    1954-10-01          0.85    399.734
2    1955-01-01          1.39    413.073
3    1955-04-01          1.43    421.532
4    1955-07-01          1.68    430.221
..          ...           ...        ...
269  2021-10-01          0.08  24349.121
270  2022-01-01          0.08   24740.48
271  2022-04-01          0.33  25248.476
272  2022-07-01          1.68  25723.941
273  2022-10-01          3.08  26132.458

[274 rows x 3 columns]

## Merged - Int Rate and Unemp

In [10]:
merged_int_unemp_df = pd.merge(int_rate_df, unemp_df, on='date')
# Rename the columns
merged_int_unemp_df = merged_int_unemp_df.rename(columns={"value_x": "Interest Rate", "value_y": "Unemployment Rate"})
# write a CSV
merged_int_unemp_df.to_csv("output_data/merged_int_unemp.csv")
merged_int_unemp_df

           date Interest Rate Unemployment Rate
0    1954-07-01          0.80               5.8
1    1954-08-01          1.22               6.0
2    1954-09-01          1.07               6.1
3    1954-10-01          0.85               5.7
4    1954-11-01          0.83               5.3
..          ...           ...               ...
818  2022-09-01          2.56               3.5
819  2022-10-01          3.08               3.7
820  2022-11-01          3.78               3.6
821  2022-12-01          4.10               3.5
822  2023-01-01          4.33               3.4

[823 rows x 3 columns]

In [11]:
# API Series ID's for China, New Zealand, Sudan
china_gdp_series_id = "MKTGDPCNA646NWDB"
nz_gdp_series_id = "MKTGDPNZA646NWDB"
sudan_gdp_series_id = "MKTGDPSDA646NWDB"

In [12]:
params_china = {"series_id": china_gdp_series_id, "apiKey": fred_key}
params_nz = {"series_id": nz_gdp_series_id, "apiKey": fred_key}
params_sudan = {"series_id": sudan_gdp_series_id, "apiKey": fred_key}

china_gdp_query = f"{fred_url}series_id={china_gdp_series_id}&api_key={fred_key}&file_type=json"
china_gdp_response = requests.get(china_gdp_query, params=params_china).json()
nz_gdp_query = f"{fred_url}series_id={nz_gdp_series_id}&api_key={fred_key}&file_type=json"
nz_gdp_response = requests.get(nz_gdp_query, params=params_nz).json()
sudan_gdp_query = f"{fred_url}series_id={sudan_gdp_series_id}&api_key={fred_key}&file_type=json"
sudan_gdp_response = requests.get(sudan_gdp_query, params=params_sudan).json()

In [13]:
china_gdp_df = pd.DataFrame(china_gdp_response["observations"])
china_gdp_df = china_gdp_df[["date", "value"]]
china_gdp_df.rename(columns={"value": "China GDP"})

          date         China GDP
0   1960-01-01  59716467625.3148
1   1961-01-01  50056868957.6732
2   1962-01-01  47209359005.6057
3   1963-01-01  50706799902.5104
4   1964-01-01  59708343488.5043
..         ...               ...
57  2017-01-01  12310409370892.8
58  2018-01-01  13894817549374.2
59  2019-01-01  14279937500606.5
60  2020-01-01  14687673892882.0
61  2021-01-01  17734062645371.4

[62 rows x 2 columns]

In [14]:
nz_gdp_df = pd.DataFrame(nz_gdp_response["observations"])
nz_gdp_df = nz_gdp_df[["date", "value"]]
nz_gdp_df.rename(columns={"value": "New Zealand GDP"})

          date   New Zealand GDP
0   1960-01-01  5485854791.97096
1   1961-01-01  5670064168.21773
2   1962-01-01  6077496267.76294
3   1963-01-01  6638937283.13963
4   1964-01-01  7274144350.81809
..         ...               ...
57  2017-01-01  206623758800.159
58  2018-01-01  211953111035.513
59  2019-01-01  213434571357.984
60  2020-01-01  211734532308.013
61  2021-01-01  249885687029.634

[62 rows x 2 columns]

In [15]:
sudan_gdp_df = pd.DataFrame(sudan_gdp_response["observations"])
sudan_gdp_df = sudan_gdp_df[["date", "value"]]
sudan_gdp_df.rename(columns={"value": "Sudan GDP"})

          date         Sudan GDP
0   1960-01-01  1307333333.33333
1   1961-01-01  1419333333.33333
2   1962-01-01  1541666666.66667
3   1963-01-01  1568333333.33333
4   1964-01-01  1611333333.33333
..         ...               ...
57  2017-01-01  129717804934.614
58  2018-01-01  32333780383.2924
59  2019-01-01  32338079165.2893
60  2020-01-01     27034593750.0
61  2021-01-01  34326058557.4418

[62 rows x 2 columns]

In [16]:
merged_1_df = pd.merge(china_gdp_df, nz_gdp_df, on="date", how="inner")
merged_1_df.head()

         date           value_x           value_y
0  1960-01-01  59716467625.3148  5485854791.97096
1  1961-01-01  50056868957.6732  5670064168.21773
2  1962-01-01  47209359005.6057  6077496267.76294
3  1963-01-01  50706799902.5104  6638937283.13963
4  1964-01-01  59708343488.5043  7274144350.81809

In [42]:
merged_countries_df = pd.merge(merged_1_df, sudan_gdp_df, on="date", how="inner")
merged_countries_df = merged_countries_df.rename(columns={"value_x": "China GDP (MM)",
                                                         "value_y": "New Zealand GDP (MM)",
                                                         "value": "Sudan GDP (MM)"})
merged_countries_df["China GDP (MM)"] = pd.to_numeric(merged_countries_df["China GDP (MM)"],errors="coerce")
merged_countries_df["New Zealand GDP (MM)"] = pd.to_numeric(merged_countries_df["New Zealand GDP (MM)"],errors="coerce")
merged_countries_df["Sudan GDP (MM)"] = pd.to_numeric(merged_countries_df["Sudan GDP (MM)"],errors="coerce")

In [43]:
merged_countries_df

          date  China GDP (MM)  New Zealand GDP (MM)  Sudan GDP (MM)
0   1960-01-01    5.971647e+10          5.485855e+09    1.307333e+09
1   1961-01-01    5.005687e+10          5.670064e+09    1.419333e+09
2   1962-01-01    4.720936e+10          6.077496e+09    1.541667e+09
3   1963-01-01    5.070680e+10          6.638937e+09    1.568333e+09
4   1964-01-01    5.970834e+10          7.274144e+09    1.611333e+09
..         ...             ...                   ...             ...
57  2017-01-01    1.231041e+13          2.066238e+11    1.297178e+11
58  2018-01-01    1.389482e+13          2.119531e+11    3.233378e+10
59  2019-01-01    1.427994e+13          2.134346e+11    3.233808e+10
60  2020-01-01    1.468767e+13          2.117345e+11    2.703459e+10
61  2021-01-01    1.773406e+13          2.498857e+11    3.432606e+10

[62 rows x 4 columns]

In [44]:
merged_countries_df["China GDP (MM)"] = round(merged_countries_df["China GDP (MM)"]/1000000,2)
merged_countries_df["New Zealand GDP (MM)"] = round(merged_countries_df["New Zealand GDP (MM)"] / 1000000,2)
merged_countries_df["Sudan GDP (MM)"] = round(merged_countries_df["Sudan GDP (MM)"] / 1000000,2)
merged_countries_df.head()

         date  China GDP (MM)  New Zealand GDP (MM)  Sudan GDP (MM)
0  1960-01-01        59716.47               5485.85         1307.33
1  1961-01-01        50056.87               5670.06         1419.33
2  1962-01-01        47209.36               6077.50         1541.67
3  1963-01-01        50706.80               6638.94         1568.33
4  1964-01-01        59708.34               7274.14         1611.33

In [48]:
countries_int = pd.merge(merged_countries_df,int_rate_df,on="date",how="left")
countries_int = countries_int.rename(columns={"value": "Interest Rate"})
countries_int

,date,China GDP (MM),New Zealand GDP (MM),Sudan GDP (MM),Interest Rate
0,1960-01-01,59716.47,5485.85,1307.33,3.99
1,1961-01-01,50056.87,5670.06,1419.33,1.45
2,1962-01-01,47209.36,6077.50,1541.67,2.15
3,1963-01-01,50706.80,6638.94,1568.33,2.92
4,1964-01-01,59708.34,7274.14,1611.33,3.48
...,...,...,...,...,...
57,2017-01-01,12310409.37,206623.76,129717.80,0.65
58,2018-01-01,13894817.55,211953.11,32333.78,1.41
59,2019-01-01,14279937.50,213434.57,32338.08,2.40
60,2020-01-01,14687673.89,211734.53,27034.59,1.55
61,2021-01-01,17734062.65,249885.69,34326.06,0.09